doom-emacs-config.org
*** Basics
#+begin_src emacs-lisp :tangle lisp/config-org.el :mkdirp yes
;;; config-org.el -*- lexical-binding: t; -*-
(defvar my/org-dir
  (expand-file-name "org-roam" "~/Library/CloudStorage/Dropbox")
  "org directory")

;; for paste picture from clipboard to org-mode
;; adapted from https://emacs-china.org/t/topic/6601/4
(defun my/org-insert-image ()
  "Insert PNG image from the clipboard to the buffer by using =pngpaste= (macos) or =xclip= (linux)

The image will be created under 'images' directory in =org-directory=
with the name from user input. If image with the same name exists, the paste
will be stopped, but the link will still be created.
Note that =pngpaste=/=xclip= should be installed outside Emacs"
  (interactive)
  (let*
    (
     (cpcmd (pcase system-type
        ('darwin "pngpaste %s")
        ('gnu/linux "xclip -selection clipboard -t image/png -o > %s")
        ))
     (path (concat mz/org-notes "/images/"))
     (fn (format "%s" (read-string "Enter image name (w/o png):")))
  	   (image-file (concat path fn ".png"))
    )
      (if (not (file-exists-p path)) (mkdir path))
      (if (file-exists-p image-file)
  	(message (format "Warning: found image %s.png in %s" fn path))
              (if cpcmd (shell-command (format cpcmd image-file))
  	              (message "Warning: clipboard -> file not suppored on this OS")
                ))
       (insert (format "#+name: fig:%s\n" fn))
       (insert "#+caption:\n")
       (insert ":IMAGE:\n")
       (insert "#+attr_org: :width 300\n")
       (insert "#+attr_latex: :width 0.6\\linewidth\n")
   (org-insert-link nil (concat "file:./images/" fn ".png") "")
       ;(insert "\n:PROPERTIES:\n:CREATED: " (format-time-string "[%Y-%m-%d %a %H:%M]") "\n:END:\n")
       (insert "\n:END:")
       ;; may add further elisp expression to suppress interaction for description
  ) ;; (org-display-inline-images) ;; inline显示图片
)

(map!
  :nv "SPC m u" #'outline-up-heading)
#+end_src

The main setting
#+begin_src emacs-lisp :tangle lisp/config-org.el :mkdirp yes
(use-package! org
  :init
  (setq org-directory my/org-dir)
  (setq org-fold-core-style 'overlays)
  :hook
  ((org-mode . org-indent-mode)
   (org-mode . visual-line-mode)
   (before-save . org-update-all-dblocks))
  :bind
  (:map org-mode-map
        ("C-c l" . org-insert-link)
        ("C-c m l l" . org-insert-link) ; similar to org-clip
        ("C-c m i" . org-toggle-item)
        ("C-c m h" . org-toggle-heading)
        ("C-c m o" . org-set-property)
        ("C-c i" . my/org-insert-image)
        ("C-c C-i" . org-time-stamp-inactive)
        ("C-c e v" . (lambda () "make verbatim"       (interactive) (org-emphasize 61)))  ; =
        ("C-c e b" . (lambda () "make bold"           (interactive) (org-emphasize 42)))  ; *
        ("C-c e s" . (lambda () "make strike-through" (interactive) (org-emphasize 43)))  ; +
        ("C-c e i" . (lambda () "make italic"         (interactive) (org-emphasize 47)))  ; /
        ("C-c e u" . (lambda () "make underline"      (interactive) (org-emphasize 95)))  ; _
        ("C-c e c" . (lambda () "make code"           (interactive) (org-emphasize 126))) ; ~
      )
  :config
  (map! :map org-mode-map
        :nv "SPC d"     #'+org/remove-link
        :nv "SPC f A"   #'org-save-all-org-buffers
        :nv "SPC a t"   #'org-agenda-todo
        :nv "DEL"       #'org-mark-ring-goto
        :nv "M-j"       #'org-metadown
        :nv "M-k"       #'org-metaup
        :nv "M-n"       #'org-next-link
        :nv "M-p"       #'org-previous-link
        :nv "SPC v n"   #'org-narrow-to-subtree
        :nv "SPC v w"   #'widen
        )
  (setq org-src-tab-acts-natively nil)
  ;; hide emphasis markers, display when move to the line (enabled by org-appera)
  (setq org-hide-emphasis-markers t)
  (setq org-archive-location (concat org-directory "/archive.org::* From %s"))
  (setq org-default-notes-file "todos.org")
  (setq org-footnote-auto-adjust t)
  (setq org-tags-column -80)
  (setq org-extend-today-until 4)    ;; end of each day
  (setq org-pretty-entities t
        org-pretty-entities-include-sub-superscripts nil)
  (setq org-clock-persist 'history
        org-clock-idle-time 10
        org-clock-mode-line-total 'current  ; show current clocking time in mode-line
                                            ; 'auto for total; 'today
  )
  (setq org-enforce-todo-checkbox-dependencies t)

  ;; agenda
  (setq org-agenda-files (concat org-directory "/org-agenda.org")
        org-agenda-skip-scheduled-if-done 't
        org-agenda-dim-blocked-tasks nil
        org-agenda-inhibit-startup 't
        ; org-log-into-drawer 't
        org-log-done 'time
        org-agenda-use-tag-inheritance '(search timeline agenda)
        org-agenda-window-setup 'reorganize-frame
  )

  ;;; capture templates
  (setq org-capture-templates
        `(
          ("t"  "Quick TODO item in todos.org")
          ("ti" "Inbox" entry
                (file+headline ,org-default-notes-file "Inbox")
                "* TODO %u %?\n%i\n%a" :prepend t)
          ("tw" "Work" entry
                (file+headline ,org-default-notes-file "工作 Work")
                "* TODO %u %?\nDEADLINE: %t" :prepend t)
          ("tl" "Life" entry
                (file+headline ,org-default-notes-file "生活 Life")
                "* TODO %u %?\nDEADLINE: %t" :prepend t)
          )
        )
  ;; org-table related.
  ;; commonly used constants for formulas
  (setq org-table-formula-constants
        '(("pi" . "3.14159265358")
          ("RY" . "13.60569301")
          ("HBAR" . "1.0545718e-34")
          ("EPS0" . "8.8541878128e−12")
          ("FSCA" . "0.0072973525664")
          ("KB" . "1.38064852e-23")
          ("CLIGHT" . "2.99792458e8")
          ("CE" . "1.6021766208e-19") ; electron charge
          ("BOHR2ANG" . "0.5291772")
          ("ANG2M" . "1e-10")
          ("EV2J" . "1.6021766208e-19")
          ("HA2EV" . "27.21138602")
          ("THZ2HA" . "1.519829846e-4") ; 10^12 h in Ha unit
          ))
  ;; default precision of formula results
  (plist-put org-calc-default-modes 'calc-internal-prec 20)
  (plist-put org-calc-default-modes 'calc-float-format '(float 12))

  ;; TODO keywords
  ; each state with ! is recorded as state change, @ require note
  (setq org-todo-keywords '((sequence "TODO(t)" "WIP(i)" "HOLD(h@)" "WAIT(w!)" "REV(r!)" "|" "DONE(d)" "CANCELLED(c!)"))
        org-todo-keyword-faces
          '(("REV" :foreground "#ff9933" :weight bold)
            ("WAIT" :foreground  "#9f7efe" :underline t)
            ("HOLD" :foreground  "black" :box t)
            ("WIP" :foreground "#0098dd" :weight bold)
            ("TODO" :foreground "#8c1400" :weight bold)
            ("DONE" :foreground "#50a14f")
            ("CANCELLED" :foreground "#ff6480" :strike-through t)
             )
  )
  ;; faces for org priority, from https://emacs.stackexchange.com/a/17405
  (setq org-priority-faces '((?A . (:foreground "red" :weight bold))
                             (?B . (:foreground "yellow"))
                             (?C . (:foreground "blue"))
                             (?D . (:foreground "green"))))

  ;; more link abbreviaiton
  (let ((link-abbrev-l '(("ytb" . "https://www.youtube.com/watch?v=%s")
                         ("isbn" . "http://books.google.com/books?vid=ISBN%s")
                         ("issn" . "http://books.google.com/books?vid=ISSN%s")
                         ("cnwiki" . "https://zh.wikipedia.org/zh-cn/%s")
                         ("arxiv" . "https://arxiv.org/abs/%s"))))
    (dolist (elem link-abbrev-l) (add-to-list 'org-link-abbrev-alist elem)))

  ;; org-babel related
  (setq org-babel-results-keyword "results")
  (setq org-confirm-babel-evaluate nil)  ;; do not need to confirm when evaluate

  ;; disable some tags from inheriting to descendants
  (dolist (elem '("noter" "Reference" "Book" "bookrev" "drill"))
    (add-to-list 'org-tags-exclude-from-inheritance elem))
)
#+end_src

~org-cliplink~ for quick extraction of link
#+begin_src emacs-lisp :tangle lisp/config-org.el :mkdirp yes
(use-package! org-cliplink
  :after org
  :bind
  (:map org-mode-map
        ("C-c m l c" . org-cliplink)))
#+end_src

~org-appear~ for showing raw content of rendered markup at cursor.
It is included with feature ~+pretty~.
#+begin_src emacs-lisp :tangle lisp/config-org.el :mkdirp yes
(use-package! org-appear
  :hook
  (org-mode . org-appear-mode)
  :config
  (setq org-appear-autolinks t
        org-appear-autoentities t)
)
#+end_src

Set ~org-download~ image directory
#+begin_src emacs-lisp :tangle lisp/config-org.el :mkdirp yes
(after! org-download
  (setq-default org-download-image-dir (concat org-directory "/images/downloads"))
)
#+end_src

#+begin_src emacs-lisp :tangle lisp/config-org.el :mkdirp yes
(after! org-archive
  (setq org-archive-mark-done t) ; change subtree state to DONE when archived
)
#+end_src

Here we finishes
#+begin_src emacs-lisp :tangle lisp/config-org.el :mkdirp yes
(provide 'config-org)
;;; config-org.el ends here
#+end_src
and load it in the main config file.
#+begin_src emacs-lisp :tangle config.el
(require 'config-org)
#+end_src

Disable ~org-fancy-priorities~ introduced by the ~+pretty~ feature.
#+begin_src emacs-lisp :tangle packages.el :mkdirp yes
(if (modulep! :lang org +pretty)
    (package! org-fancy-priorities :disable t))
#+end_src

*** Recurring task

Support by [[https://github.com/mrcnski/org-recur][~org-recur~]] package

#+begin_src emacs-lisp :tangle packages.el :mkdirp yes
(package! org-recur
  :recipe (:host github :repo "mrcnski/org-recur"))
#+end_src

#+begin_src emacs-lisp :tangle lisp/config-org-recur.el :mkdirp yes
;;; config-org-recur.el -*- lexical-binding: t; -*-

(use-package! org-recur
  :hook ((org-mode . org-recur-mode)
         (org-agenda-mode . org-recur-agenda-mode))
  :config
  (define-key org-recur-mode-map (kbd "C-c d") 'org-recur-finish)

  ;; Rebind the 'd' key in org-agenda (default: `org-agenda-day-view').
  (define-key org-recur-agenda-mode-map (kbd "d") 'org-recur-finish)
  (define-key org-recur-agenda-mode-map (kbd "C-c d") 'org-recur-finish)

  (setq org-recur-finish-done t
        org-recur-finish-archive t))

(provide 'config-org-recur)
;;; config-org-recur.el ends here
#+end_src

#+begin_src emacs-lisp :tangle config.el :mkdirp yes
(require 'config-org-recur)
#+end_src

*** Drill
#+begin_src emacs-lisp :tangle packages.el :mkdirp yes
(package! org-drill
  :recipe (:host gitlab :repo "phillord/org-drill"))
#+end_src

#+begin_src emacs-lisp :tangle lisp/config-org-drill.el :mkdirp yes
;;; config-org-drill.el -*- lexical-binding: t; -*-
(use-package! org-drill
  :after org
  :commands org-drill org-drill-resume
  :init
  (map! :map org-mode-map
        :nv "SPC m d d" #'org-drill
        :nv "SPC m d r" #'org-drill-resume)
  :config
  (setq org-drill-scope 'directory)
  (setq org-drill-spaced-repetition-algorithm 'sm2)
  (setq org-drill-adjust-intervals-for-early-and-late-repetitions-p t)
  (setq org-drill-add-random-noise-to-intervals-p t)
  ;; reduce space, repeat more
  (setq org-drill-learn-fraction 0.30)
)

(provide 'config-org-drill)
;;; config-org-drill.el ends here
#+end_src

#+begin_src emacs-lisp :tangle config.el :mkdirp yes
(require 'config-org-drill)
#+end_src

*** Export

**** Prologue
#+begin_src emacs-lisp :tangle lisp/config-ox.el :mkdirp yes
;;; config-ox.el -*- lexical-binding: t; -*-
(require 's)
#+end_src

**** General configuration for all languages

#+begin_src emacs-lisp :tangle lisp/config-ox.el :mkdirp yes
(after! ox
  (setq org-export-broken-links 'mark)
)
#+end_src

**** Extra functionality by ~ox-extra~
#+begin_src emacs-lisp :tangle lisp/config-ox.el :mkdirp yes
(use-package! ox-extra
  :after ox
  :config
  (ox-extras-activate '(ignore-headlines)))
#+end_src

