doom-emacs-config.org
**** LaTeX/Beamer
First define two variables for handling headers for latex export

#+begin_src emacs-lisp :tangle lisp/config-ox.el :mkdirp yes
(defvar my/org-latex-classes-common-header-passoptions
  (s-join "\n"
    '("\\PassOptionsToPackage{usenames,dvipsnames}{xcolor}"
      "\\PassOptionsToPackage{colorlinks=true,linkcolor=,filecolor=Red,citecolor=Green,urlcolor=Rhodamine,pdfborder={0 0 0},breaklinks=true,linktoc=all}{hyperref}"))
  "PassOptions setting before document class, included in org-latex-classes for exporting org to latex")

(defvar my/org-latex-classes-common-header-after-default-pkgs
  (s-join "\n"
    '("% redefine quote environment - blockquote from eisvogel"
      "\\definecolor{bg}{rgb}{0.95,0.95,0.95}"
      "\\definecolor{bq-border}{RGB}{0, 63, 126}"
      "\\newmdenv[rightline=false,bottomline=false,topline=false,linewidth=3pt,backgroundcolor=bg,%"
      "           linecolor=bq-border,skipabove=\\parskip]{customblockquote}"
      "\\renewenvironment{quote}{\\begin{customblockquote}\\itshape\\list{}{\\rightmargin=6pt\\leftmargin=6pt}%"
      "\\item\\relax\\ignorespaces}{\\unskip\\unskip\\endlist\\end{customblockquote}}"
      "\\let\\Oldtextbullet\\textbullet"
      "\\renewcommand{\\textbullet}{\\textcolor{bq-border}{\\Oldtextbullet}}"
      "% compact itemize by paralist packages"
      "\\usepackage{paralist}"
      "\\let\\itemize\\compactitem"
      "\\let\\description\\compactdesc"
      "\\let\\enumerate\\compactenum"
      ))
  "Headers after default packages setting, included in org-latex-classes for exporting org to latex")
#+end_src

#+begin_src emacs-lisp :tangle lisp/config-ox.el :mkdirp yes
(use-package! ox-latex
  :bind
  ("C-c x l" . org-latex-export-to-latex)
  ("C-c x o" . org-latex-export-to-pdf)
  :config

  ;; use latexmk to automate toolchain
  (setq org-latex-pdf-process '("latexmk -latexoption=\"-interaction=nonstopmode -shell-escape\" -pdf -pdflatex=%latex -bibtex -f %f"))

  ;; prefer custom label
  (setq org-latex-prefer-user-labels t)

  ;; remove default hyperset with author names included
  ;; for local variable setup, use for each file
  ;; # -*- org-latex-hyperref-template: nil; -*-

  ;; default packages to load right after documentclass at first
  (setq org-latex-default-packages-alist
    '(
      ("" "amsmath" t) ; to avoid iint and iiint error
      ("" "amssymb" t)
      ("" "wasysym" t) ; last to avoid iint and iint error
      ("AUTO" "inputenc"  t ("pdflatex"))
      ("T1"   "fontenc"   t ("pdflatex"))
      (""     "CJKutf8"   t ("pdflatex"))
      (""     "ifxetex"   nil)
      (""     "ctex"      nil ("xelatex", "xetex"))
      (""     "xeCJK"     nil ("xelatex", "xetex"))
      (""     "fontspec"  nil ("xelatex", "xetex", "lualatex", "luatex"))
      (""     "graphicx"  t)
      (""     "xcolor"  t)
      ; ("nottoc,numbib"     "tocbibind" nil)
      ; corresponding to "setq org-latex-listings t"
      ; (""           "listings"   nil)
      ; but minted is better to use
      ("newfloat,cache=true"   "minted"   nil)
      (""     "grffile"   t)
      ; (""     "longtable" nil)
      (""     "mdframed" nil)   ; for creating blockquote
      (""     "float" nil)
      (""     "wrapfig"   nil)
      (""     "subfig"    nil)
      (""     "rotating"  nil)
      ("normalem" "ulem"  t)    ; strikeout
      (""     "textcomp"  t)
      (""     "capt-of"   nil)
      ("font={small},skip=1pt"     "caption"   nil)
      (""     "parskip"   nil)  ; better paragraph spacing
      (""     "booktabs"   nil) ; better table
	 )
  )

  ; packages to load at last
  (setq org-latex-packages-alist
    '(
      ; hyperref and cleverf should be the last packages to load
      ("" "hyperref"  nil)
      ("" "cleveref"  nil)
     )
  )

  ; customized classes for latex export
  (setq org-latex-classes
               `(
                ("article"
                  ,(s-join "\n"
                      `(
                         ,my/org-latex-classes-common-header-passoptions
                         "\\documentclass[11pt,a4paper]{article}"
                         "[DEFAULT-PACKAGES]"
                         ,my/org-latex-classes-common-header-after-default-pkgs
                         "[EXTRA]"
                         "[PACKAGES]"))
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))
                )
  )
)
#+end_src

**** Epilogue
#+begin_src emacs-lisp :tangle lisp/config-ox.el :mkdirp yes
(provide 'config-ox)
;;; config-ox.el ends here
#+end_src

#+begin_src emacs-lisp :tangle config.el
(require 'config-ox)
#+end_src

*** Presentation
#+begin_src emacs-lisp :tangle lisp/config-org-present.el :mkdirp yes
;;; config-org-present.el -*- lexical-binding: t; -*-
(use-package! org-tree-slide
  :after org
  :bind
  (:map org-tree-slide-mode-map
        ("<f9>" . 'org-tree-slide-move-previous-tree)
        ("<f10>" . 'org-tree-slide-move-next-tree)
        ("<f11>" . 'org-tree-slide-content))
  (:map org-mode-map
        ("<f8>" . 'org-tree-slide-mode)
        ("S-<f8>" . 'org-tree-slide-skip-done-toggle))
  :config
  (setq org-tree-slide-skip-outline-level 4)
  (org-tree-slide-narrowing-control-profile)
  (setq org-tree-slide-skip-done nil)
)

(provide 'config-org-present)
;;; config-org-present.el ends here
#+end_src

#+begin_src emacs-lisp :tangle config.el :mkdirp yes
(require 'config-org-present)
#+end_src

*** Roam
#+begin_src emacs-lisp :tangle lisp/config-org-roam.el :mkdirp yes
;;; config-org-roam.el -*- lexical-binding: t; -*-

(use-package! org-roam
  :after org-roam
  :init
  (setq org-roam-directory org-directory
        org-roam-index-file "index.org"
        org-roam-graph-extra-config '(("overlap" . "false")) ; man dot for attributes setup
        )
  :bind
  (:map org-mode-map
        (("C-c r R" . org-roam-buffer-toggle)
         ("C-c r ." . org-roam-node-find)
         ("C-c r L" . org-roam-store-link)
         ("C-c r a" . org-roam-alias-add)
         ("C-c r u" . org-roam-unlinked-references)
         ("C-c r r" . org-roam-find-ref)
         ("C-c r d" . org-roam-find-directory)
         ("C-c r j" . org-roam-jump-to-index)
         ("C-c r b" . org-roam-switch-to-buffer)
         ("C-c r n" . orb-note-actions)
         ("C-c r i" . org-roam-node-insert)
         )
  )
  :config
  (add-to-list 'display-buffer-alist
                '("\\*org-roam\\*"
                  (display-buffer-in-direction)
                  (direction . right)
                  (window-width . 0.33)
                  (window-height . fit-window-to-buffer)))
  (setq org-roam-extract-new-file-path "${slug}.org")
  (org-roam-db-autosync-mode)
  (setq org-roam-node-display-template
        (format "${doom-hierarchy:*} %s %s"
                (propertize "${doom-type:12}" 'face 'font-lock-keyword-face)
                (propertize "${doom-tags:32}" 'face 'org-tag)))
  (setq org-roam-capture-templates
        '(
          ("d" "default" plain "%?"
           :if-new (file+head "${slug}.org"
                              "# -*- truncate-lines: t -*-\n#+title: ${title}\n#+startup: content\n#+created: %U\n")
           :unnarrowed t)
          ("b" "non-STEM book note" plain "%?"
           :if-new (file+head "bookrev/${slug}.org"
           "# -*- truncate-lines: t -*-\n#+title: ${title}\n#+startup: overview\n#+created: %U\n#+options: toc:nil email:t f:t\n")
           :unnarrowed t)
         ))
)

(provide 'config-org-roam)
;;; config-org-roam.el ends here
#+end_src

#+begin_src emacs-lisp :tangle config.el
(require 'config-org-roam)
#+end_src

*** noter

Use the new maintained repository
#+begin_src emacs-lisp :tangle packages.el
(when (modulep! :lang org +noter)
  (package! org-noter :recipe
    (:host github :repo "org-noter/org-noter"
     :files ("*.el" "modules/*.el"))))
#+end_src

#+begin_src emacs-lisp :tangle lisp/config-org-noter.el :mkdirp yes
;;; config-org-noter.el -*- lexical-binding: t; -*-

(after! org-noter
  (setq org-noter-always-create-frame nil  ;; Please stop opening frames
        org-noter-hide-other nil           ;; I want to see the whole file

        ;; Everything is relative to the main notes file
        org-noter-notes-search-path (list my/org-dir)

        ;; split fraction. default (0.5 . 0.5). slightly larger on vertical
        org-noter-doc-split-fraction '(0.58 . 0.5)
  )
)

(provide 'config-org-noter)
;;; config-org-noter.el ends here
#+end_src

#+begin_src emacs-lisp :tangle config.el
(require 'config-org-noter)
#+end_src

** Tools
*** command-log-mode
#+begin_src emacs-lisp :tangle packages.el
(package! command-log-mode)
#+end_src

#+begin_src emacs-lisp :tangle lisp/config-command-log-mode.el :mkdirp yes
;;; config-command-log-mode.el -*- lexical-binding: t; -*-
(use-package! command-log-mode)

(provide 'config-command-log-mode)
;;; config-command-log-mode.el ends here
#+end_src

#+begin_src emacs-lisp :tangle config.el
(require 'config-command-log-mode)
#+end_src

*** dictionary
#+begin_src emacs-lisp :tangle packages.el
(if IS-MAC
  (package! osx-dictionary))
#+end_src

#+begin_src emacs-lisp :tangle lisp/config-dictionary.el :mkdirp yes
;;; config-dictionary.el -*- lexical-binding: t; -*-
(if IS-MAC
  (progn
    (use-package! osx-dictionary
      :bind
      (:map global-map
            ("C-c d" . osx-dictionary-search-word-at-point))
      :config
    )
  )
)

(provide 'config-dictionary)
;;; config-dictionary.el ends here
#+end_src

#+begin_src emacs-lisp :tangle config.el
(require 'config-dictionary)
#+end_src

*** rg

#+begin_src emacs-lisp :tangle packages.el
(package! rg)
#+end_src

#+begin_src emacs-lisp :tangle lisp/config-rg.el :mkdirp yes
;;; config-rg.el -*- lexical-binding: t; -*-

(use-package! rg
  :bind
  (:map global-map
        ("C-c r g r" . rg)
        ("C-c r g m" . rg-menu)
        ("C-c r g d" . rg-dwim)
        ("C-c r g f" . rg-dwim-current-file)
      )
  :config
  (setq rg-keymap-prefix "\C-cg")
  (setq rg-ignore-case 'smart)
  (rg-enable-default-bindings)
)

(provide 'config-rg)
;;; config-rg.el ends here
#+end_src

#+begin_src emacs-lisp :tangle config.el
(require 'config-rg)
#+end_src

*** PDF

#+begin_src emacs-lisp :tangle lisp/config-pdf.el :mkdirp yes
;;; config-pdf.el -*- lexical-binding: t; -*-
(after! pdf-view
  (map! :map pdf-view-mode-map
        :nv "z g"        #'pdf-view-goto-page
        :nv "z r"        #'image-rotate       ;; rotate the page (defined in image.el)
        :nv "SPC a a l"  #'pdf-annot-list-annotations
        :nv "SPC a a h"  #'pdf-annot-add-highlight-markup-annotation
        :nv "SPC a a u"  #'pdf-annot-add-underline-markup-annotation
        )
)

(after! pdf-tools
  :config
  ;; activate when opening pdf, otherwise the evil keybindings will not work
  (pdf-loader-install)
)

(provide 'config-pdf)
;;; config-pdf.el ends here
#+end_src

#+begin_src emacs-lisp :tangle config.el
(require 'config-pdf)
#+end_src

*** RSS by elfeed

#+begin_src emacs-lisp :tangle lisp/config-rss.el :mkdirp yes
;;; config-rss.el -*- lexical-binding: t; -*-

(after! elfeed
  ;; override default 2-week-ago filter by doom emacs
  (setq elfeed-search-filter "")
)

(use-package! elfeed-org
  :after org
  :preface
  (setq rmh-elfeed-org-files `(,(expand-file-name "elfeed.org" org-directory)))
)

(provide 'config-rss)
;;; config-rss.el ends here
#+end_src

#+begin_src emacs-lisp :tangle config.el
(require 'config-rss)
#+end_src

*** Git: magit, git-gutter

#+begin_src emacs-lisp :tangle lisp/config-git.el :mkdirp yes
;;; config-git.el -*- lexical-binding: t; -*-

;; use "SPC g a" for add hunk, aside from the default "SPC g s"
(map! :leader
      (:prefix-map ("g" . "git")
       (:when (modulep! :ui vc-gutter)
        :desc "stage hunk at point"       "a"   #'+vc-gutter/stage-hunk)))

;; do not ask confirm for stage/revert
(after! git-gutter
  (setq git-gutter:ask-p nil))

(provide 'config-git)
;;; config-git.el ends here
#+end_src

#+begin_src emacs-lisp :tangle config.el
(require 'config-git)
#+end_src

* Customizations

#+begin_src emacs-lisp :tangle custom.el
(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(safe-local-variable-values
   '((org-latex-and-related-regexp)
     (org-highlight-latex-and-related)
     (org-drill-hide-item-headings-p . t)
     (org-latex-hyperref-template)))
)
#+end_src
